IdeaRS.OpenModel.Connection.BoltGrid
Data of the bolt grid

IdeaRS.OpenModel.Connection.BoltGrid.Id
Unique Id of the bolt grid

IdeaRS.OpenModel.Connection.BoltGrid.HoleDiameter
The diameter of the hole

IdeaRS.OpenModel.Connection.BoltGrid.BoltAssemblyName
The description of the bolt assembly

IdeaRS.OpenModel.Connection.BoltGrid.Origin
Origin of the bolt grid LCS

IdeaRS.OpenModel.Connection.BoltGrid.AxisX
Bolt grid LCS - Axis X

IdeaRS.OpenModel.Connection.BoltGrid.AxisY
Bolt grid LCS - Axis Y

IdeaRS.OpenModel.Connection.BoltGrid.AxisZ
Bolt grid LCS - Axis Z

IdeaRS.OpenModel.Connection.BoltGrid.Positions
Positions of holes in the local coodinate system of the bolt grid

IdeaRS.OpenModel.Connection.BoltGrid.ConnectedPlates
Identifiers of the connected plates